-- phpMyAdmin SQL Dump
-- version 4.1.6
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2014-10-23 13:35:28
-- 服务器版本： 5.6.16
-- PHP Version: 5.5.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `yincart`
--

-- --------------------------------------------------------

--
-- 表的结构 `item`
--

CREATE TABLE IF NOT EXISTS `item` (
  `item_id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT 'Item ID',
  `category_id` int(10) unsigned NOT NULL COMMENT 'Category ID',
  `outer_id` varchar(45) DEFAULT NULL,
  `title` varchar(255) NOT NULL COMMENT '名称',
  `stock` int(10) unsigned NOT NULL COMMENT '库存',
  `min_number` int(10) unsigned NOT NULL DEFAULT '1' COMMENT '最少订货量',
  `price` decimal(10,2) unsigned NOT NULL COMMENT '价格',
  `currency` varchar(20) NOT NULL COMMENT '币种',
  `props` longtext NOT NULL COMMENT '商品属性 格式：pid:vid;pid:vid',
  `props_name` longtext NOT NULL COMMENT '商品属性名称。标识着props内容里面的pid和vid所对应的名称。格式为：pid1:vid1:pid_name1:vid_name1;pid2:vid2:pid_name2:vid_name2……(注：属性名称中的冒号":"被转换为："#cln#"; 分号";"被转换为："#scln#" )',
  `desc` longtext NOT NULL COMMENT '描述',
  `cost_intro` longtext NOT NULL,
  `schedule` longtext NOT NULL,
  `shipping_fee` decimal(10,2) unsigned NOT NULL DEFAULT '0.00' COMMENT '运费',
  `is_show` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '是否显示',
  `is_promote` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '是否促销',
  `is_new` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '是否新品',
  `is_hot` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '是否热销',
  `is_best` tinyint(1) unsigned NOT NULL DEFAULT '0' COMMENT '是否精品',
  `click_count` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '点击量',
  `wish_count` int(10) unsigned NOT NULL DEFAULT '0' COMMENT '收藏数',
  `review_count` int(10) NOT NULL,
  `deal_count` int(10) NOT NULL,
  `create_time` int(10) unsigned NOT NULL COMMENT '创建时间',
  `update_time` int(10) unsigned NOT NULL COMMENT '更新时间',
  `language` varchar(45) NOT NULL,
  `country` int(10) unsigned NOT NULL,
  `state` int(10) unsigned NOT NULL,
  `city` int(10) unsigned NOT NULL,
  PRIMARY KEY (`item_id`),
  KEY `fk_item_category1_idx` (`category_id`),
  KEY `fk_item_area1_idx` (`country`),
  KEY `fk_item_area2_idx` (`state`),
  KEY `fk_item_area3_idx` (`city`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=60 ;

--
-- 转存表中的数据 `item`
--

INSERT INTO `item` (`item_id`, `category_id`, `outer_id`, `title`, `stock`, `min_number`, `price`, `currency`, `props`, `props_name`, `desc`, `cost_intro`, `schedule`, `shipping_fee`, `is_show`, `is_promote`, `is_new`, `is_hot`, `is_best`, `click_count`, `wish_count`, `review_count`, `deal_count`, `create_time`, `update_time`, `language`, `country`, `state`, `city`) VALUES
(28, 112, '123456', '<海南5日游>销量第一，1整天蜈支洲，4晚180°海景', 443, 1, '2839.00', '￥', '{"1":"1:2","2":["2:4","2:5"],"3":["3:8"]}', '{"\\u54c1\\u724c":"\\u54c1\\u724c:jackjones","\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:L","\\u5c3a\\u5bf8:XL"],"\\u989c\\u8272":["\\u989c\\u8272:\\u9ec4\\u8272"]}', '<p>三亚一地的牛人专线，安排最有含金量景点，行程轻松不赶路，热销2年，不是吹的~</p>\r\n\r\n<p>购物安排：\r\n 全程不进任何购物店，保证游览时间，真正0购物</p>\r\n\r\n<p>游玩安排：\r\n    有限的时间只停驻在最美的地方：  D2. 非诚勿扰2取景地【亚龙湾天堂森林公园】 天下第一湾【亚龙湾国际旅游度假区】  D3.【4A天涯海角】 【5A南山大小洞天】9月16日团期起，行程改为【蜈支洲岛】一整天  D4. 沐浴阳光一整天电影私人定制拍摄地【蜈支洲岛】，玩足一整天，不再仅仅只是常规跟团线路那匆匆一瞥；9月16日团期起，行程改为【4A天涯海角】 【5A南山大小洞天】</p>\r\n\r\n<p>住宿安排：\r\n    指定酒店连住4晚180度海景房（中途不换酒店）  超值升级方案，升级4晚三亚湾海边一线挂五星酒店——三亚阳光大酒店或天通建国酒店  旺季收客火爆，一家酒店已经不能满足牛人们啦，我们会精心挑选三家好品质酒店，详情请查看行程第一天</p>\r\n\r\n<p>用餐安排：\r\n    全程安排指定餐厅用餐，将普通团队的15元餐标提高至25元/人/餐的标准，围桌餐保证十菜一汤或自助餐</p>\r\n\r\n<p>贴心赠送：\r\n    跟团期间每成人赠送海南岛岛服一套，每天一瓶矿泉水</p>\r\n', '<p>\r\n费用包含\r\n\r\n1.交通：往返团队经济舱机票含税费（团队机票将统一出票，如遇政府或航空公司政策性调整燃油税费，在未出票的情况下将进行多退少补，敬请谅解。团队机票一经开出，不得更改、不得签转、不得退票），当地旅游巴士。\r\n\r\n2.小交通：景区内用车（亚龙湾热带天堂森林公园电瓶车）。\r\n\r\n3.小交通：三亚凤凰机场往返接送服务。\r\n\r\n4.住宿：行程所列酒店。\r\n\r\n5.用餐：行程中团队标准用餐，全程安排5正4早（酒店含早，正餐餐标25元/人/餐；十人一桌、十菜一汤），如每桌人数不是为10人，则餐费不变的情况下，酌情增减菜品数量，参考菜单中个别菜品可能随时令有所调整。（中式餐或自助餐或特色餐，自由活动期间用餐请自理；如因自身原因放弃用餐，则餐费不退）。\r\n\r\n6.门票：行程中所含的景点首道大门票。\r\n\r\n7.导服：当地中文导游。\r\n\r\n8.儿童价标准：年龄2~12周岁（不含），不占床，含往返机票（含税）、半价正餐、导服、旅游车车位，其他当地自理。\r\n\r\n9.赠送：三亚政府调节基金。\r\n\r\n费用不包含\r\n\r\n1.小交通：景区内用车。\r\n\r\n2.小交通：出发地机场往返接送服务。\r\n\r\n3.单房差。\r\n\r\n4.其他：由于跟团推荐的自费项目门票，已经为旅行社折扣价格，所以客人自行购买自费项目的门票，需要补导游80元/人/项目的费用方可跟车参加。\r\n\r\n5.因交通延阻、罢工、天气、飞机机器故障、航班取消或更改时间等不可抗力原因所引致的额外费用。\r\n\r\n6.酒店内洗衣、理发、电话、传真、收费电视、饮品、烟酒等个人消费。\r\n\r\n7.当地参加的自费以及以上“费用包含”中不包含的其它项目。\r\n\r\n8.旅游人身意外保险 </p>', '{"1":"出发地 至 三亚","2":"亚龙湾沙滩 亚龙湾热带天堂森林公园","3":"蜈支洲岛纯玩海一整天","4":"大小洞天 天涯海角","5":"三亚 回 出发地"}', '0.01', 1, 1, 1, 1, 1, 1091, 0, 0, 1, 1388133167, 1414040810, 'zh_cn', 100000, 460000, 460200),
(31, 112, '123456', '<宁波-普陀山-普济寺双动车4日游>动车往返，1人成行', 56858, 1, '1991.00', '￥', '{"1":"1:1","2":["2:5","2:6"],"3":["3:8","3:9"]}', '{"\\u54c1\\u724c":"\\u54c1\\u724c:GXG","\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:XL","\\u5c3a\\u5bf8:XXL"],"\\u989c\\u8272":["\\u989c\\u8272:\\u9ec4\\u8272","\\u989c\\u8272:\\u84dd\\u8272"]}', '<p>游览普陀名山古刹，感受禅的智慧，聆听“观音不肯去”的美妙传说。</p>\r\n\r\n<p>用餐安排：三正餐三早餐（酒店含早、25元/正餐、十人一桌、正餐是八菜一汤，不含酒水、如人数未达十人，菜的数量也会随之减少、但餐标不变）<\p>', '', '', '0.01', 1, 1, 1, 1, 1, 518, 0, 0, 4, 1388133378, 1413811637, 'zh_cn', 100000, 130000, 130700),
(35, 129, '123456789', 'GXG男士长款大衣/帽子不可拆 内衬可拆', 1748, 1, '2198.00', '￥', '{"4":["4:10","4:11"],"5":["5:16","5:17"],"6":["6:20","6:21"],"7":["7:22","7:23"]}', '{"\\u54c1\\u724c":["\\u54c1\\u724c:GXG","\\u54c1\\u724c:gxg.jeans"],"\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:L","\\u5c3a\\u5bf8:XL"],"\\u989c\\u8272":["\\u989c\\u8272:\\u767d\\u8272","\\u989c\\u8272:\\u7c73\\u8272"],"\\u9886\\u5e26":["\\u9886\\u5e26:1","\\u9886\\u5e26:2"]}', '<p>22222</p>\r\n', '', '', '0.01', 1, 1, 1, 1, 1, 421, 0, 0, 5, 1388394491, 1413545525, 'zh_cn', 100000, 220000, 220500),
(37, 129, '', 'GXG正品男士冬装新款大衣', 1476, 1, '743.00', '￥', '{"4":["4:10","4:11","4:12"],"5":["5:15","5:16"],"6":["6:19","6:20"],"7":["7:23"]}', '{"\\u54c1\\u724c":["\\u54c1\\u724c:GXG","\\u54c1\\u724c:gxg.jeans","\\u54c1\\u724c:jackjones"],"\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:M","\\u5c3a\\u5bf8:L"],"\\u989c\\u8272":["\\u989c\\u8272:\\u9ed1\\u8272","\\u989c\\u8272:\\u767d\\u8272"],"\\u9886\\u5e26":["\\u9886\\u5e26:2"]}', '<p>哦哈哈哈哈哈哈哈哈</p>\r\n', '', '', '0.00', 1, 1, 1, 1, 1, 144, 0, 0, 1, 1390455802, 1413464994, 'zh_cn', 100000, 130000, 130700),
(38, 129, '', 'GXG男士经典中长款正品大衣', 1999, 1, '1099.00', '￥', '{"4":["4:10","4:11","4:14"],"5":["5:15"],"6":["6:19"],"7":["7:22"]}', '{"\\u54c1\\u724c":["\\u54c1\\u724c:GXG","\\u54c1\\u724c:gxg.jeans","\\u54c1\\u724c:\\u96c5\\u6208\\u5c14"],"\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:M"],"\\u989c\\u8272":["\\u989c\\u8272:\\u9ed1\\u8272"],"\\u9886\\u5e26":["\\u9886\\u5e26:1"]}', '<p>按时打算</p>\r\n', '', '', '5.00', 1, 1, 1, 1, 1, 84, 0, 0, 1, 1390456979, 1404125094, 'zh_cn', 100000, 110000, 110100),
(40, 129, '', 'GXG代购新品 男士时尚长款大衣', 12, 1, '944.00', '￥', '{"4":["4:10"],"5":["5:15"],"6":["6:19"],"7":["7:22"]}', '{"\\u54c1\\u724c":["\\u54c1\\u724c:GXG"],"\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:M"],"\\u989c\\u8272":["\\u989c\\u8272:\\u9ed1\\u8272"],"\\u9886\\u5e26":["\\u9886\\u5e26:1"]}', '<p>1</p>\r\n', '', '', '0.00', 1, 1, 1, 1, 1, 12, 0, 0, 0, 1390457291, 1404805390, 'zh_cn', 100000, 120000, 120100),
(41, 129, '', 'GXG正品男士时尚修身英伦双排扣大衣', 31, 1, '829.00', '￥', '{"4":["4:11"],"5":["5:16"],"6":["6:20"],"7":["7:23"]}', '{"\\u54c1\\u724c":["\\u54c1\\u724c:gxg.jeans"],"\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:L"],"\\u989c\\u8272":["\\u989c\\u8272:\\u767d\\u8272"],"\\u9886\\u5e26":["\\u9886\\u5e26:2"]}', '<p>312</p>\r\n', '', '', '0.00', 1, 1, 1, 1, 1, 3, 0, 0, 0, 1390457329, 1397457161, 'zh_cn', 100000, 420000, 429006),
(42, 129, '', 'GXG正品男士时尚修身英伦长款双排扣大衣', 121, 1, '829.00', '￥', '{"4":["4:12"],"5":["5:18"],"6":["6:21"],"7":["7:23"]}', '{"\\u54c1\\u724c":["\\u54c1\\u724c:jackjones"],"\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:XXL"],"\\u989c\\u8272":["\\u989c\\u8272:\\u7c73\\u8272"],"\\u9886\\u5e26":["\\u9886\\u5e26:2"]}', '<p>1234</p>\r\n', '', '', '0.00', 1, 1, 1, 1, 1, 7, 0, 0, 1, 1390457367, 1397457182, 'zh_cn', 100000, 110000, 110100),
(43, 130, '', '女春秋2014毛呢外套中长款蕾丝大衣韩版显瘦羊毛修身裙摆呢子秋冬', 123, 1, '198.00', '￥', '{"8":["8:24"]}', '{"\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:X"]}', '<p>uioyu</p>\r\n', '', '', '0.00', 1, 1, 1, 1, 1, 15, 0, 0, 0, 1390457554, 1404793719, 'zh_cn', 100000, 420000, 429005),
(44, 130, '', '2013秋冬女装韩版宽松中长款A毛领羊毛呢大衣外套斗篷娃娃领13231', 1123, 1, '664.00', '￥', '{"8":["8:24","8:25"]}', '{"\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:X","\\u5c3a\\u5bf8:XL"]}', '<p>sdf</p>\r\n', '', '', '0.00', 0, 0, 0, 0, 0, 18, 0, 0, 0, 1390457903, 1398130656, 'zh_cn', 100000, 430000, 431300),
(45, 130, '', '春装新款2014韩版羊绒格子女毛呢大衣外套中长款修身型女冬腰带潮', 1123, 1, '228.00', '￥', '{"8":["8:24","8:25"]}', '{"\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:X","\\u5c3a\\u5bf8:XL"]}', '<p>asda</p>\r\n', '', '', '0.00', 1, 1, 1, 1, 1, 15, 0, 0, 0, 1390457981, 1397457284, 'zh_cn', 100000, 420000, 421100),
(46, 130, '', '2014春季新款正品韩版修身呢子外套女中长款毛呢外套显瘦毛呢大衣', 123, 1, '168.00', '￥', '{"8":["8:24"]}', '{"\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:X"]}', '<p>we</p>\r\n', '', '', '0.00', 1, 1, 1, 1, 1, 8, 0, 0, 1, 1390458029, 1404802465, 'zh_cn', 100000, 110000, 110100),
(47, 130, '', '2013新款秋冬韩版修身毛呢外套通勤简约显瘦中长款羊毛呢子大衣女', 12, 1, '220.00', '￥', '{"8":["8:24"]}', '{"\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:X"]}', '<p>啊</p>\r\n', '', '', '0.00', 1, 1, 1, 1, 1, 10, 0, 0, 0, 1390458065, 1397457319, 'zh_cn', 100000, 420000, 429021),
(48, 130, '', '蝶臣 早春新款2014 韩版长袖毛呢大衣', 12312, 1, '82.00', '￥', '{"8":["8:25"]}', '{"\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:XL"]}', '<p>收到发送到</p>\r\n', '', '', '0.00', 1, 1, 1, 1, 1, 3, 0, 0, 0, 1390458106, 1397457341, 'zh_cn', 100000, 430000, 431200),
(49, 110, '', '促销限量 七朵棉 新品加厚顶级超柔套件 纯棉活性磨毛四4件套', 136, 1, '355.50', '￥', '{"1":"1:2","2":["2:3","2:4"],"3":["3:8"]}', '{"\\u54c1\\u724c":"\\u54c1\\u724c:jackjones","\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:M","\\u5c3a\\u5bf8:L"],"\\u989c\\u8272":["\\u989c\\u8272:\\u9ec4\\u8272"]}', '<p>fds</p>\r\n', '', '', '0.00', 1, 1, 1, 1, 1, 14, 0, 0, 0, 1390458341, 1413464999, 'zh_cn', 100000, 120000, 120100),
(50, 110, '', '新品波点磨毛四件套 天丝芦荟棉床单式床上用品四件套 特价包邮', 123, 1, '88.00', '￥', '{"1":"1:2","2":["2:3"],"3":["3:7"]}', '{"\\u54c1\\u724c":"\\u54c1\\u724c:jackjones","\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:M"],"\\u989c\\u8272":["\\u989c\\u8272:\\u7ea2\\u8272"]}', '<p>czxcds</p>\r\n', '', '', '0.00', 1, 1, 1, 1, 1, 5, 0, 0, 1, 1390458577, 1397457375, 'zh_cn', 100000, 130000, 130200),
(52, 110, '', '黛维家纺正品 全棉斜纹磨毛贡缎印花四件套纯棉公主床单床上用品', 12, 1, '256.00', '￥', '{"1":"1:1","2":["2:5"],"3":["3:7"]}', '{"\\u54c1\\u724c":"\\u54c1\\u724c:GXG","\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:XL"],"\\u989c\\u8272":["\\u989c\\u8272:\\u7ea2\\u8272"]}', '<p>sdwas</p>\r\n', '', '', '0.00', 1, 1, 1, 1, 1, 4, 0, 0, 1, 1390458724, 1397457413, 'zh_cn', 100000, 150000, 150400),
(53, 110, '', '夏季透气双层纱布被套纯棉四件套 全棉床笠床品床上四件套 包邮', 18, 1, '539.00', '￥', '{"1":"1:1","2":["2:3"],"3":["3:7"]}', '{"\\u54c1\\u724c":"\\u54c1\\u724c:GXG","\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:M"],"\\u989c\\u8272":["\\u989c\\u8272:\\u7ea2\\u8272"]}', '<p>dsadw</p>\r\n', '', '', '0.00', 1, 1, 1, 1, 1, 0, 0, 0, 0, 1390458756, 1397457433, 'zh_cn', 100000, 130000, 130500),
(57, 111, '', '亏本蚕丝枕芯护颈枕芯48x74枕头芯特价清仓甩卖单人枕枕头长方形', 122, 1, '28.00', '￥', '{"10":["10:28"]}', '{"\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:18cm"]}', '<p>121</p>\r\n', '', '', '0.00', 1, 1, 1, 1, 1, 21, 0, 0, 1, 1390460239, 1397457522, 'zh_cn', 100000, 110000, 110100),
(58, 111, '', '梦洁家纺 枕头枕芯 全棉防雨布立体纤丝羽绒枕 单人枕特价正品', 2, 1, '64.00', '￥', '{"10":["10:29"]}', '{"\\u5c3a\\u5bf8":["\\u5c3a\\u5bf8:50cm"]}', '<p>trete</p>\r\n', '', '', '0.00', 1, 1, 1, 1, 1, 35, 0, 0, 1, 1390460360, 1413976776, 'zh_cn', 100000, 360000, 360300),
(59, 126, '', ' 三星 I9128I ', 55577, 1, '1438.00', '￥', '{"11":["11:30","11:31"]}', '{"\\u5206\\u8fa8\\u7387":["\\u5206\\u8fa8\\u7387:1200x800","\\u5206\\u8fa8\\u7387:780x400"]}', '<p>sadasd</p>\r\n', '', '', '0.00', 1, 1, 1, 1, 1, 68, 0, 0, 2, 1390460489, 1404799084, 'zh_cn', 100000, 360000, 360300);

--
-- 限制导出的表
--

--
-- 限制表 `item`
--
ALTER TABLE `item`
  ADD CONSTRAINT `fk_item_area1` FOREIGN KEY (`country`) REFERENCES `area` (`area_id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `fk_item_area2` FOREIGN KEY (`state`) REFERENCES `area` (`area_id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `fk_item_area3` FOREIGN KEY (`city`) REFERENCES `area` (`area_id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `fk_item_category1` FOREIGN KEY (`category_id`) REFERENCES `category` (`category_id`) ON DELETE CASCADE ON UPDATE CASCADE;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
